{
    "updated": "1 day",
    "authenticated": true,
    "feed_tags": [],
    "classifiers": {
        "authors": {
            "Jeff Atwood": 1
        },
        "feeds": {
            "2": 1
        },
        "titles": {},
        "tags": {}
    },
    "elapsed_time": 0.23,
    "feed_id": 2,
    "stories": [
        {
            "story_authors": "",
            "intelligence": {
                "feed": 1,
                "tags": 0,
                "author": 0,
                "title": 0
            },
            "shared_by_friends": [],
            "story_permalink": "http://www.codinghorror.com/blog/2013/04/so-you-dont-want-to-be-a-programmer-after-all.html",
            "reply_count": 0,
            "comment_user_ids": [],
            "id": "http://www.codinghorror.com/blog/2013/04/so-you-dont-want-to-be-a-programmer-after-all.html",
            "share_user_ids": [
                82036
            ],
            "story_hash": "2:54cbb7",
            "comment_count": 0,
            "story_tags": [],
            "share_count": 1,
            "friend_comments": [],
            "story_date": "2013-04-29 23:45:34",
            "share_count_public": 1,
            "friend_user_ids": [],
            "public_user_ids": [
                82036
            ],
            "short_parsed_date": "29 Apr 2013, 7:45pm",
            "guid_hash": "54cbb7",
            "share_count_friends": 0,
            "story_feed_id": 2,
            "long_parsed_date": "Monday, April 29th, 2013 7:45pm",
            "public_comments": [],
            "read_status": 1,
            "shared_by_public": [
                82036
            ],
            "commented_by_public": [],
            "has_modifications": true,
            "story_title": "So You Don't Want to be a Programmer After All",
            "story_content": "<p>I get a surprising number of emails from career programmers who have spent some time in the profession and eventually decided it just isn't for them. Most recently this: </p> <blockquote>I finished a computer science degree last year, worked about a year in the Java EE stack. I liked requirements engineering and more 'management stuff' in university, but let's face it: you tend to be driven to be a programmer. <p>I enjoy programming itself. I'm not doing it <i>that</i> badly, I even do it better <ins>than</ins> <del>that</del> some people. But it's too <ins>frustrating.</ins> <del>frustrating to me.</del> Stupidly complex stuff (that people consider \"standard\" even if it's extremely complicated!), fighting against the computer, dumb errors, configuration, and stuff that people even worse than me implemented and I have to take care of. New stuff which is supposed to be incredibly easy, and it's just one more framework. </p> <p>I think I realized I don't want to program because I landed at a company where people are quite good. And I honestly think I won't achieve that level, ever. And I don't enjoy programming as <ins>a</ins> hobby. </p> <p>I'm sure that I'm good enough to be able to make a living continuing as I am … but I don't want to. </p> </blockquote> <p>And this: </p> <blockquote><p>Since the first year of studying programming at university I have known in my heart that computer programming is not meant for me, but I was afraid to do anything about it and here I am now 12 years later programming with no passion. I am a career programmer and an average one at best. </p> <p>I come to work every day with no passion I just do it to pay the bills. I have done some good projects but I am not at all into it. </p> </blockquote> <p>It was always our hope that <b>concrete, substantive programming career questions</b> <del>like these</del> could be asked on Stack Overflow, and some <a href=\"http://meta.stackoverflow.com/questions/12373/which-types-of-programming-related-questions-are-appropriate\">early ad-hoc <del>community</del> polling</a> indicated that career questions might be accepted by the community, but if you look at <a href=\"http://meta.stackoverflow.com/questions/12373/which-types-of-programming-related-questions-are-appropriate\">later poll results</a>, it's clear that the career questions came out <i>juuuust</i> under the cutoff point as determined by the Stack Overflow community. </p> <p>Well, what about the rest of the <a href=\"http://stackexchange.com/sites?view=list\">Stack Exchange network</a>? How about our sister site at <ins><a href=\"http://blog.stackoverflow.com/2010/12/introducing-programmers-stackexchange-com/\">programmers.stackexchange</a></ins> <del><a href=\"http://blog.stackoverflow.com/2010/12/introducing-programmers-stackexchange-com/\">programmers.stackexchange.com</a></del> which is less about programming problems with source code and more about whiteboard style conceptual programming questions? Apparently, career questions are <a href=\"http://meta.programmers.stackexchange.com/questions/3828/canonical-what-can-i-do-with-my-programming-skills-if-im-weary-of-heads-down-c\">not welcome there either</a>. But wait! Surely programmer career questions are a fit on a site that's explicitly <i>about</i> career related topics? The very same question was asked on <a href=\"http://workplace.stackexchange.com/\">workplace.stackexchange</a>: </p><p></p><blockquote><p>I'm graduating soon with a Bachelor's in Software Engineering, however during the course of getting my degree I decided I do not want to be a programmer.</p> <p>I minored in Business Management and really enjoyed that, particularly the management side of psychology and the basics of the processes involved with restructuring a business, but don't really want to throw away my programming degree either.</p> <p>Is there a field for someone with a Software Engineering degree who wants to get into business management instead of programming? I'd like to combine my knowledge of making software with some kind of business process oriented work. How should I go about changing to this field? Is this possible without going back to school?</p> </blockquote> <a href=\"http://workplace.stackexchange.com/questions/2658/what-kind-of-business-fields-are-available-to-a-programmer-who-no-longer-wants-t\">Nope. Sorry.</a> That was closed, too, either because it was seen as a 'recommend me a job' or because it's too specific to programming. Pick your interpretation. <p>I am sympathetic to this quandary because <b>career questions, by their very nature, tend to be so narrow and opinionated</b> that they are frequently only useful to the person who asked – which is completely counter to the goal of Stack Exchange. You know, endless permutations of things like \"My boss Jeff is a total jerk, he constantly changes my code without asking and overrides me all the time with his BS arbitrary decisions, should I quit?\"* I can understand deciding to outlaw the entire class of career questions because they're frequently soft, opinion-y, and highly specific to the person asking. It's easier to <del>just</del> throw out the whole category <ins>rather</ins> than do the painful work of sifting through them all to <ins>reveal</ins> <del>find</del> those few rare workable gems. </p> <p> <ins>Stack Exchange wants</ins> <del>We want</del> <b>questions that are as useful to as many people as possible</b>, and actively <a href=\"http://meta.stackoverflow.com/questions/173497/every-close-has-its-thorn-replace-close-with-on-hold-for-the-first-five-d\"> <ins>closes (sorry, \"puts</ins> <del>close (sorry, \"put</del> on hold\"</a>) the ones that are not. I will now reprint my favorite diagram, ever, which attempts to explain this: </p> <p><img alt=\"Who does your question apply to?\" border=\"0\" src=\"http://www.codinghorror.com/.a/6a0120a85dcdae970b019101a6e7b7970c-800wi\" title=\"Who does your question apply to?\"></p> <p>The colored part in this target that says \"All Programmers\"? That's the goal at Stack Exchange. <ins>Well, maybe \"all <a href=\"http://bicycles.stackexchange.com\">bicyclists</a>\", or \"all <a href=\"http://cooking.stackexchange.com/\">cooks</a>\", but you get the general idea.</ins> </p> <p>We try our best to teach you to ask questions that <del>help you</del> hit this sweet spot: <ins>answers</ins> <del>questions</del> that get you the information you so desperately need, yes, but also help <ins>your peers</ins> <del>others</del> along the way without devolving into <a href=\"http://www.codinghorror.com/blog/2009/03/procrastination-and-the-bikeshed-effect.html\">meaningless opinion honeypots</a>. Overshoot and you get either \"Too Broad\" or \"Too Localized\". Hitting that target with our questions – or at least making a best faith effort to attempt to, anyway – is how we maximize the results of our collective efforts. Write once, read many. </p> <p>But back to the topic: <b>what career options are available to programmers who no longer want to program?</b> I feel there <i>is</i> a way to answer this question that would be helpful to many other programmers, that <i>is</i> supported by facts and data and science. </p> <p>Programming is indeed a field that <a href=\"http://www.codinghorror.com/blog/2008/12/programming-love-it-or-leave-it.html\">does require some passion</a>. If you've been programming for a few years and haven't developed a taste for it by now, it seems doubtful to me that anyone would suddenly develop one overnight. However, if you were able to stick with doing something you're not very enthusiastic about for a period of years, maybe there's still a kernel of something there to work with. Or perhaps you're just wearing golden handcuffs. </p> <p><ins><img alt=\"Golden-handcuffs\" height=\"253\" src=\"http://www.codinghorror.com/.a/6a0120a85dcdae970b017eeaaf686e970d-800wi\" title=\"Golden-handcuffs\" width=\"600\"></ins></p> <p>Environment plays a big part in any job, no matter <a href=\"http://online.wsj.com/article/SB10001424127887324874204578439154095008558.html\">how intrinsically amazing that job might be</a>. Who do you work with? What are you working on? What kind of environment do you program in: </p> <ul><li>A startup?</li> <li>A small business?</li> <li>A big business?</li> <li>A consultancy?</li> <li>Freelance?</li> </ul><p>The \"programming\" in each of these situations, and the other peer programmers you'll be working with, will be radically different. Consider if the <i>environment</i> and <i>peers</i> may be the problem. Have you tried changing those up, first, before conclusively deciding you need to leave the field forever? </p> <p>Beyond that, there are lots of <b>related fields where programming skills are advantageous</b>, without having \"sit down and write code all day\" as part of the job description. So let's think. What jobs exist where … </p> <p></p><ol><li>Programming skills and a deep technical background are typically in the hiring requirements.</li> <li>There is a documented record of ex-programmers moving into these positions and being successful.</li> <li>There are a reasonable number of such jobs available worldwide.</li> </ol><p>Here's where I really wished I could have asked this on Stack Exchange, because I'd much rather <b>crowdsource data to support the above three points</b>, but the best I could come up with on my own is: </p> <ul><li><a href=\"http://www.25hoursaday.com/weblog/CommentView.aspx?guid=25c92015-9172-4bc8-8f91-f901f8811aff\">Product/Program Manager</a></li> <li>Project Manager</li> <li>QA / Testing (good testers are <a href=\"http://www.codinghorror.com/blog/2006/09/making-developers-cry-since-1995.html\">worth their weight in gold</a>)</li> <li>Build Engineering (this stuff <a href=\"http://www.codinghorror.com/blog/2007/10/the-f5-key-is-not-a-build-process.html\">is hard</a>)</li> <li>System Administrator</li> <li>Technical Sales</li> <li><ins>Technical Writer</ins></li> <li>Business Analyst / Programming Analyst</li> </ul><p>In many of these roles, people that truly know the nuts and bolts of programming are quite rare. That's unfortunate, because a deep technical background lets you actually <i>understand</i> and explain what is going on, to customers, to business stakeholders, to peers on related teams. At the very least nobody can dazzle you with technical BS, because you're equipped to call their bluff. </p> <p>I've seen <del>the</del> less \"adept\" programmers self-select into related roles at previous jobs and do very well, both financially and professionally. There is a <i>lot</i> of stuff that goes on around programming that is not heads down code writing, where your programming skills <ins>are a competitive advantage.</ins> <del>will come in extremely handy.</del> </p> <p>Career questions are tough, because ultimately only you can decide what's right for you. But if you're a programmer who no longer likes to program, your technical background can at least <b>open the door to a number of related professions</b>. </p> <p><small>* Yes, you should quit. Jeff is a total jerkface.</small> </p> <table><tr><td class=\"welovecodinghorror\">[advertisement] How are you showing off your awesome? Create a <a href=\"http://careers.stackoverflow.com/cv\" rel=\"nofollow\">Stack Overflow Careers profile</a> and show off all of your hard work from Stack Overflow, Github, and virtually every other coding site. Who knows, you might even get recruited for a great <a href=\"http://careers.stackoverflow.com/jobs\" rel=\"nofollow\">new position</a>! </td></tr></table>",
            "commented_by_friends": []
        },
        {
            "story_authors": "",
            "intelligence": {
                "feed": 1,
                "tags": 0,
                "author": 0,
                "title": 0
            },
            "shared_by_friends": [],
            "story_permalink": "http://www.codinghorror.com/blog/2013/03/why-ruby.html",
            "reply_count": 0,
            "comment_user_ids": [
                115931,
                106973
            ],
            "id": "http://www.codinghorror.com/blog/2013/03/why-ruby.html",
            "share_user_ids": [
                120868,
                115931,
                116690,
                106973,
                81613,
                24291,
                25745
            ],
            "comment_count_friends": 0,
            "story_hash": "2:1ce6b6",
            "comment_count": 2,
            "story_tags": [],
            "share_count": 7,
            "friend_comments": [],
            "story_date": "2013-03-22 08:34:08",
            "share_count_public": 7,
            "friend_user_ids": [],
            "public_user_ids": [
                24291,
                120868,
                81613,
                25745,
                116690,
                115931,
                106973
            ],
            "short_parsed_date": "22 Mar 2013, 4:34am",
            "guid_hash": "1ce6b6",
            "share_count_friends": 0,
            "story_feed_id": 2,
            "long_parsed_date": "Friday, March 22nd, 2013 4:34am",
            "public_comments": [
                {
                    "liking_users": [],
                    "source_user_id": null,
                    "user_id": 115931,
                    "shared_date": "36 days",
                    "comments": "I could not agree more regarding the value of something not being cool/cutting edge.",
                    "replies": [],
                    "date": "2013-04-01 15:40:27.637000",
                    "id": "5159aa6b5d571d66e8d3bc63"
                },
                {
                    "liking_users": [
                        91680
                    ],
                    "source_user_id": null,
                    "user_id": 106973,
                    "shared_date": "44 days",
                    "comments": "I could have written this. \"For the most part, Ruby took Perl's string processing and Unix integration as-is, meaning the syntax is identical, and so right there, before anything else happens, you already have the Best of Perl. And that's a great start, especially if you don't take the Rest of Perl.\"",
                    "replies": [],
                    "date": "2013-03-24 06:08:44.335000",
                    "id": "514e986c409b6110aa68ade8"
                }
            ],
            "read_status": 1,
            "shared_by_public": [
                25745,
                116690,
                24291,
                120868,
                81613
            ],
            "commented_by_public": [
                115931,
                106973
            ],
            "has_modifications": true,
            "comment_count_public": 2,
            "story_title": "Why Ruby?",
            "story_content": "<p>I've been a Microsoft developer for decades now. I weaned myself on various flavors of <a href=\"http://www.codinghorror.com/blog/2008/04/everything-i-needed-to-know-about-programming-i-learned-from-basic.html\">home computer Microsoft Basic</a>, and I got my first paid programming gigs in Microsoft FoxPro, Microsoft Access, and Microsoft Visual Basic. I have seen the future of programming, my friends, and it is terrible CRUD apps running on Wintel boxes! </p> <p>Of course, we went on to build Stack Overflow in <ins>Microsoft</ins> .NET. That's a big reason it's still as fast as it is. So one of the most frequently asked questions after we <a href=\"http://www.codinghorror.com/blog/2013/02/civilized-discourse-construction-kit.html\">announced Discourse</a> <ins>was:</ins> <del>was</del> </p><p></p><blockquote><p>Why didn't you build Discourse in .NET, too?</p> </blockquote> <p>Let me be clear about something: I <i>love</i> .NET. One of the greatest thrills of my professional career was getting the opportunity to place a Coding Horror sticker in the hand of <a href=\"http://en.wikipedia.org/wiki/Anders_Hejlsberg\">Anders Hejlsberg</a>. Pardon my inner fanboy for a moment, but oh man I still get chills. There are maybe fifty world class computer language designers on the planet. Anders is the only one of them who built Turbo Pascal and Delphi. It is thanks to Anders' expert guidance that .NET started out such a remarkably well designed language – literally what Java should have been on every conceivable level – and has continued to evolve in remarkably practical ways over the last 10 years, leveraging the strengths of other influential dynamically typed languages. </p> <p><img alt=\"Turbo-pascal\" height=\"395\" src=\"http://www.codinghorror.com/.a/6a0120a85dcdae970b017d42306e26970c-800wi\" title=\"Turbo-pascal\" width=\"700\"></p> <p>All that said, it's true that I intentionally chose <i>not</i> to use .NET for my next project. So you might expect to find an angry, righteous screed here about how much happier I am leaving the oppressive shackles of my Microsoft masters behind. <i>Free at last, free at least, thank God almighty I'm free at last!</i></p> <p>Sorry. <a href=\"http://www.codinghorror.com/blog/2007/05/giving-up-on-microsoft.html\">I already wrote that post five years ago</a>. </p> <p>Like any pragmatic programmer, I pick the appropriate tool for the job at hand. And as much as I may love .NET, <b>it <ins>would be</ins> <del>is</del> an extraordinarily poor choice for an 100% open source project like Discourse.</b> Why? Three reasons, mainly: </p> <ol><li><p><b>The licensing.</b> My God, <i>the licensing</i>. It's not so much the money, as the infernal, mind-bending tax code level complexity <ins>involved in</ins> <del>of</del> making sure all your software is properly licensed: determining what 'level' and 'edition' you are licensed at, who is licensed to use what, which servers are licensed... wait, what? Sorry, I passed out there for a minute when I was attacked by <a href=\"http://www.codinghorror.com/blog/2009/07/oh-you-wanted-awesome-edition.html\">rabid licensing weasels</a>.</p> <p>I'm not inclined to make grand pronouncements about the future of software, but if anything kills off commercial software, let me tell you, it won't be open source software. They needn't bother. Commercial software will gleefully strangle itself to death on its own licensing terms.</p> </li> <li><p><b>The friction</b>. If you want to build truly viable open source software, you need people to contribute to your project, so that it is a living, breathing, growing thing. And unless you can download all the software you need to hack on your project freely from all over the Internet, no strings attached, there's just … too much friction. </p> If Stack Overflow taught me anything, it is that we now live in a world where the next brilliant software engineer can come from anywhere on the planet. I'm talking places <a href=\"http://www.codinghorror.com/blog/2009/03/the-ugly-american-programmer.html\">this ugly <ins>American</ins> <del>american</del> programmer</a> has never heard of, where they speak crazy nonsense moon languages I can't understand. But get this. Stand back while I blow your mind, people: these brilliant programmers <i>still code in the same keywords we do!</i> I know, crazy, right? <p>Getting up and running with a Microsoft stack is just plain too <ins>hard</ins> <del>complicated</del> for a developer in, say, Argentina, or Nepal, or Bulgaria. Open source operating systems, languages, and tool chains are the great equalizer, the basis for the next great generation of programmers all over the world who are going to help us change the world.</p> </li> <li><p><b>The ecosystem</b>. When I was at Stack Exchange <a href=\"http://blog.stackoverflow.com/2012/02/stack-exchange-open-source-projects/\">we strove mightily</a> to make as much of our infrastructure open source as we could. It was something that we made explicit in the compensation guidelines, this idea that we would all be (partially) judged by how much we could do in public, and try to leave behind as many useful, public artifacts of our work as we could. Because <ins>wasn't</ins> all of Stack Exchange itself, from the very first day, <del>was</del> <a href=\"http://blog.stackoverflow.com/2009/06/stack-overflow-creative-commons-data-dump/\">built on your Creative Commons contributions</a> that we all share ownership <ins>of?</ins> <del>of.</del> </p> <p>You can certainly build open source software in .NET. And many do. But it never feels natural. It never feels right. Nobody accepts your patch to a core .NET class library no matter how hard you try. It always feels like you're swimming upstream, in a world of small and large businesses using .NET that really aren't interested in sharing their code with the world – probably because they know it would suck if they did, anyway. It is just not a native part of the Microsoft .NET culture to make things open source, <i>especially not the things that suck</i>. <ins>If you are afraid the things you share will suck, that fear will render you incapable of truly and deeply giving back. The most, uh, delightful… bit of open source communities is how they aren't afraid to let it \"all hang out\", so to speak.</ins> </p> <p>So as a result, for any given task in .NET you might have – if you're lucky – a choice of maybe two decent-ish libraries. Whereas in any popular open source language, you'll <i>easily</i> have a dozen choices for the same task. <ins>Yeah, maybe</ins> <del>The bad news is that</del> six of them will be broken, <ins>obsolete,</ins> <del>obslete,</del> useless, or downright crazy. But hey, even factoring in some natural open source spoilage, you're still ahead by a factor of three! <ins><i>A winner is you!</i></ins> </p> </li> </ol><p>As I wrote <a href=\"http://www.codinghorror.com/blog/2007/05/giving-up-on-microsoft.html\">five years ago</a>: </p> <blockquote>I'm a pragmatist. For now, I choose to live in the Microsoft universe. But that doesn't mean I'm ignorant of how the other half lives. There's always more than one way to do it, and just because I chose one particular way doesn't make it the right way – or even a particularly good way. Choosing to be provincial and insular is a sure-fire path to ignorance. Learn how the other half lives. Get to know some developers who don't live in the exact same world you do. Find out what tools they're using, and why. If, after getting your feet wet on both sides of the fence, you decide the other half is living better and you want to join them, then I bid you a fond farewell. </blockquote> I no longer live in the Microsoft universe any more. Right, wrong, <ins>good, evil,</ins> that's just how it turned out for the project we wanted to build. <img alt=\"Im-ok-with-this\" height=\"329\" src=\"http://www.codinghorror.com/.a/6a0120a85dcdae970b017c38010328970b-800wi\" title=\"Im-ok-with-this\" width=\"596\"><p>However, I'd also be lying if I didn't mention that I truly believe the sort of project we are building in Discourse does represent most future software. If you squint your eyes a little, I think you can see a future <ins>not too far in the distance</ins> where .NET is a specialized niche outside the mainstream. </p><p>But <b>why Ruby?</b> Well, the short and not very glamorous answer is that I had narrowed it down to either Python or Ruby, and my <ins>original</ins> co-founder <a href=\"http://eviltrout.com/\">Robin Ward</a> has been building major Rails apps since 2006. So that clinched it. </p> <p>I've always been a little intrigued by Ruby, mostly because of <a href=\"https://sites.google.com/site/steveyegge2/tour-de-babel\">the absolutely gushing praise Steve Yegge had for the language way back in 2006</a>. I've never forgotten this. </p> <blockquote><p>For the most part, Ruby took Perl's string processing and Unix integration as-is, meaning the syntax is identical, and so right there, before anything else happens, you already have the Best of Perl. And that's a great start, especially if you don't take the Rest of Perl. </p> <p>But then Matz took the best of list processing from Lisp, and the best of OO from Smalltalk and other languages, and the best of iterators from CLU, and pretty much the best of everything from everyone. </p> <p>And he somehow made it all work together so well that you don't even notice that it has all that stuff. I learned Ruby faster than any other language, out of maybe 30 or 40 total; it took me about 3 days before I was more comfortable using Ruby than I was in Perl, after eight years of Perl hacking. It's so consistent that you start being able to guess how things will work, and you're right most of the time. It's beautiful. And fun. And practical. </p> </blockquote> <p>Steve is one of those <ins>polyglot</ins> programmers I <a href=\"http://www.codinghorror.com/blog/2012/07/but-you-did-not-persuade-me.html\">respect so much</a> that I basically just take whatever his opinion is, provided it's not about something wacky like gun control or feminism or T'Pau, and accept it as fact. </p> <p>I apologize, Steve. I'm sorry it took me 7 years to get around to Ruby. But maybe I was better off waiting a while anyway: </p> <ul><li><p>Ruby is a decent performer, but you really need to <b>throw fast hardware at it for good performance</b>. Yeah, I know, <a href=\"http://www.codinghorror.com/blog/2006/02/the-day-performance-didnt-matter-any-more.html\">interpreted languages are what they are</a>, and caching, database, network, blah blah blah. Still, we obtained the absolute fastest CPUs you could buy for the Discourse servers, 4.0 Ghz Ivy Bridge Xeons, and performance is just … <i>good</i> on today's <ins>fastest</ins> hardware. Not great. <i>Good.</i></p> <p>Yes, I'll admit that I am utterly spoiled by the JIT compiled performance of .NET. That's what I am used to. I do sometimes pine away for the bad old days of .NET when we could build pages that serve in well under 50 milliseconds without thinking about it too hard. Interpreted languages aren't going to be able to reach those performance levels. But I can only imagine how rough Ruby performance had to be back in the dark ages of 2006 when CPUs and servers were <i>five times slower than they are today!</i> I'm so very glad that I am hitting Ruby now, with the strong wind of many solid years of Moore's law at our backs.</p> </li><li><p>Ruby is <b>maturing up nicely</b> in the <a href=\"http://www.ruby-lang.org/en/news/2013/02/24/ruby-2-0-0-p0-is-released/\">2.0 language release</a>, which happened not more than a month after Discourse was announced. So, yes, the downside is that Ruby is slow. But the upside is there is a <i>lot</i> of low hanging performance fruit in Ruby-land. Like.. <i>a lot</i> a lot. On Discourse we got an across the board 20% performance improvement just upgrading to Ruby 2.0, and we nearly <i>doubled</i> our performance by <a href=\"http://meta.discourse.org/t/tuning-ruby-and-rails-for-discourse/4126\">increasing the default Ruby garbage collection <ins>limit. From a future performance perspective, Ruby is nothing but upside.</ins> </a> <del>limit.</del> </p> </li><li><p>Ruby <b>isn't cool any more</b>. Yeah, you heard me. It's not cool to write Ruby <ins>code</ins> any more. All the cool people moved on to <ins>slinging</ins> <del>writing</del> Scala and Node.js years ago. Our project isn't cool, it's just a bunch of boring old Ruby code. Personally, I'm <i>thrilled</i> that Ruby is now mature enough that the community no longer needs to bother <ins>with the pretense of being the coolest</ins> <del>pretending to be being the cool</del> kid on the block. That means the rest of us who just like to Get Shit Done can roll up our sleeves and focus on the <ins>mission</ins> <del>task</del> of building stuff with our peers rather than frantically running around trying to <a href=\"http://www.codinghorror.com/blog/2008/01/the-magpie-developer.html\"> <ins>suss out</ins> <del>figure out what</del> the next shiny thing <del>is</del> </a>. </p> </li></ul><p>And of <i>course</i> the Ruby community is, and always has been, amazing. We never want for great open source gems and great open source contributors. Now is a <ins>fantastic</ins> <del>great</del> time to get into Ruby, in my opinion, whatever your background is. </p> (However, It's also worth mentioning that Discourse is, if anything, even more of a <b>JavaScript project</b> than a Ruby on Rails project. Don't believe me? Just go to <a href=\"http://try.discourse.org\">try.discourse.org</a> and view source. A Discourse forum is not so much a website as it is a full-blown JavaScript application that happens to run in your browser.) <p>Even if done in good <ins>will and for the best interests of</ins> <del>will, and even if it is the right choice for</del> the project, it's still a little scary to <ins>totally</ins> change your programming stripes overnight after two decades. <del>But</del> I've always believed that great programmers learn to <del>use and</del> love more than one language and programming environment – and I hope the Discourse project is an opportunity for <i>everyone</i> to learn and grow, not just me. <b>So <a href=\"https://github.com/discourse/discourse\"> <ins>go</ins> <del>what are you waiting for? Go</del> fork us on <ins>GitHubalready!</ins> <del>GitHub!</del> </a> </b> </p> <table><tr><td class=\"welovecodinghorror\">[advertisement] Hiring developers? Post your open positions with <a href=\"http://careers.stackoverflow.com\" rel=\"nofollow\">Stack Overflow Careers</a> and reach over 20MM awesome devs already on Stack Overflow. Create <a href=\"http://careers.stackoverflow.com/jobs/post\" rel=\"nofollow\">your satisfaction-guaranteed job listing</a> today! </td></tr></table>",
            "commented_by_friends": []
        },
        {
            "story_authors": "",
            "intelligence": {
                "feed": 1,
                "tags": 0,
                "author": 0,
                "title": 0
            },
            "shared_by_friends": [],
            "story_permalink": "http://www.codinghorror.com/blog/2013/02/civilized-discourse-construction-kit.html",
            "reply_count": 0,
            "comment_user_ids": [
                33448,
                24548,
                25431,
                27384,
                43759
            ],
            "id": "http://www.codinghorror.com/blog/2013/02/civilized-discourse-construction-kit.html",
            "share_user_ids": [
                33448,
                24548,
                25431,
                27384,
                32048,
                25694,
                43759
            ],
            "comment_count_friends": 0,
            "story_hash": "2:1ee816",
            "comment_count": 5,
            "story_tags": [],
            "share_count": 7,
            "friend_comments": [],
            "story_date": "2013-02-05 19:59:53",
            "share_count_public": 7,
            "friend_user_ids": [],
            "public_user_ids": [
                24548,
                33448,
                43759,
                32048,
                25431,
                27384,
                25694
            ],
            "short_parsed_date": "05 Feb 2013, 2:59pm",
            "guid_hash": "1ee816",
            "share_count_friends": 0,
            "story_feed_id": 2,
            "long_parsed_date": "Tuesday, February 5th, 2013 2:59pm",
            "public_comments": [
                {
                    "liking_users": [],
                    "source_user_id": null,
                    "user_id": 43759,
                    "shared_date": "85 days",
                    "comments": "Probably right.",
                    "replies": [],
                    "date": "2013-02-11 11:07:59.109000",
                    "id": "5118d10ff01b305483d554e4"
                },
                {
                    "liking_users": [
                        25518
                    ],
                    "source_user_id": null,
                    "user_id": 27384,
                    "shared_date": "90 days",
                    "comments": "atwood strikes back",
                    "replies": [],
                    "date": "2013-02-06 07:04:18.008000",
                    "id": "51120072f01b30515ac4fe80"
                },
                {
                    "liking_users": [],
                    "source_user_id": null,
                    "user_id": 25431,
                    "shared_date": "91 days",
                    "comments": "Hell yeah!",
                    "replies": [],
                    "date": "2013-02-05 23:02:43.973000",
                    "id": "51118f93f01b300f4ad5694e"
                },
                {
                    "liking_users": [
                        25518
                    ],
                    "source_user_id": null,
                    "user_id": 24548,
                    "shared_date": "91 days",
                    "comments": "This looks promising, with a great team behind it.  I like the Wordpress model- open source software, paid hosting (if you want it).",
                    "replies": [],
                    "date": "2013-02-05 20:57:00.707000",
                    "id": "5111721cf01b3055a1c1b7af"
                },
                {
                    "liking_users": [
                        24548,
                        25431,
                        3833
                    ],
                    "source_user_id": null,
                    "user_id": 33448,
                    "shared_date": "91 days",
                    "comments": "This looks very promising...\n",
                    "replies": [],
                    "date": "2013-02-05 20:32:47.389000",
                    "id": "51116c6ff01b304c4d5777b3"
                }
            ],
            "read_status": 1,
            "shared_by_public": [
                32048,
                25694
            ],
            "commented_by_public": [
                43759,
                27384,
                25431,
                24548,
                33448
            ],
            "comment_count_public": 5,
            "story_title": "Civilized Discourse Construction Kit",
            "story_content": "<p>\nOccasionally, startups will ask me for advice. That's a shame, because I am <a href=\"http://www.codinghorror.com/blog/2012/05/how-to-stop-sucking-and-be-awesome-instead.html\">a terrible person to ask for advice</a>. The conversation usually goes something like this:\n</p>\n<blockquote>\n<p><i>We'd love to get your expert advice on our thing.</i></p>\n<p>I probably don't use your thing. Even if I tried your thing out and I gave you my <a href=\"http://www.codinghorror.com/blog/2009/02/are-you-an-expert.html\">so-called Expert advice</a>, how would it matter? Anyway, why are you asking <i>me?</i> <b>Why don't you ask your community what <i>they</i> think of your thing?</b></p>\n<p>\nAnd if you don't have a community of users and customers around your thing, well, there's your problem right there. Go fix <i>that</i>.\n</p>\n</blockquote>\n<p>\nLike I said, I don't get asked for advice too often. But for what it's worth, it is serious advice. And the next question they ask always strikes fear into my heart.\n</p>\n<blockquote>\n<p><i>You're so right! We need a place for online community around our thing. What software should we use?</i></p>\n</blockquote>\n<p>\nThis is the part where I start playing <a href=\"http://www.sadtrombone.com/\">sad trombone</a> in my head. Because <b>all your software options for online community are, quite frankly, <i>terrible</i>.</b> Stack Exchange? We only do strict, focused Q&amp;A there and you'd have to marshal your proposal through <a href=\"http://area51.stackexchange.com/\">Area 51</a>. Get Satisfaction, UserVoice, Desk, etcetera? Sorry, customer support isn't the same as community. Mailing lists? Just awful.</p>\n<p>Forum software? <i>Maybe.</i> Let's see, it's 2013, has forum software advanced at all in the last <i>ten years?</i>\n</p>\n<p>\n<table>\n<tr>\n<td style=\"vertical-align: top;\">\n<a href=\"http://web.archive.org/web/20000815063701/http://boards.straightdope.com/sdmb/\" style=\"border-bottom: none;\">\n<img alt=\"Straight Dope forums in 2000\" height=\"208\" src=\"http://www.codinghorror.com/.a/6a0120a85dcdae970b017ee834156c970d-800wi\" style=\"border: 1px solid silver;\" title=\"Straight Dope forums in 2000\" width=\"365\" /></a>\n</td>\n<td style=\"vertical-align: top;\">\n<a href=\"http://boards.straightdope.com/sdmb/\" style=\"border-bottom: none;\">\n<img alt=\"Straight Dope forums in 2012\" height=\"283\" src=\"http://www.codinghorror.com/.a/6a0120a85dcdae970b017c3690c747970b-pi\" style=\"border: 1px solid silver;\" title=\"Straight Dope forums in 2013\" width=\"365\" />\n</a>\n</td>\n</tr>\n</table>\n</p>\n<p>\nI'm thinking no.\n</p>\n<p>\nForums are the dark matter of the web, the B-movies of the Internet. But they matter. To this day <b>I regularly get excellent search results on forum pages for stuff I'm interested in</b>. Rarely a day goes by that I don't end up on some forum, somewhere, looking for some obscure bit of information. And more often than not, I find it there.\n</p>\n<p>\nThere's an amazing depth of information on forums.\n</p>\n<ul>\n<li>A 12 year old girl who finds a forum community of rabid enthusiasts willing to help her rebuild a Fiero from scratch? <a href=\"http://blog.makezine.com/2012/07/25/maker-faire-detroit-the-girl-who-plays-with-fieros-interview/\">Check</a>.\n<li>The most obsessive breakdown of Lego collectible minifig kits you'll find anywhere on the Internet? <a href=\"http://www.eurobricks.com/forum/index.php?showtopic=67132\">Check</a>.\n<li>Some of the most practical information on stunt kiting in the world? <a href=\"http://www.gwtwforum.com/\">Check</a>.\n<li>The only place I could find with scarily powerful squirt gun instructions and advice? <a href=\"http://www.waterwar.net/site_wwn/board/\">Check</a>.\n<li>The underlying research for a <a href=\"http://www.newyorker.com/reporting/2012/08/06/120806fa_fact_singer?currentPage=all\">New Yorker article</a> outing a potential serial marathon cheater? <a href=\"http://www.letsrun.com/forum/flat_read.php?thread=3863010\">Check</a>. \n</ul>\n<p>\nI could go on and on. As much as existing forum software is inexplicably and terrifyingly awful after all these years, it is still the ongoing basis for a huge chunk of deeply interesting information on the Internet. These communities are incredibly passionate about incredibly obscure things. They aren't afraid to let their freak flag fly, and the world is a better place for it.\n</p>\n<p>\nAt Stack Exchange, one of the tricky things we learned about Q&amp;A is that if your goal is to have an excellent signal to noise ratio, <b>you <i>must</i> suppress discussion.</b> Stack Exchange only supports the absolute minimum amount of discussion necessary to produce great questions and great answers. That's why answers get constantly re-ordered by votes, that's why comments have limited formatting and length and only a few display, and so forth. Almost every design decision we made was informed by our desire to push discussion down, to inhibit it in every way we could. Spare us the long-winded diatribe, just <i>answer the damn question already</i>.\n</p>\n<p>\nAfter spending four solid years thinking of discussion as the established corrupt empire, and <a href=\"http://blog.stackoverflow.com/2009/05/the-stack-overflow-trilogy/\">Stack Exchange as the scrappy rebel alliance</a>, I began to wonder &ndash; what would it feel like to change sides? What if I became a champion of random, arbitrary discussion, of the very kind that I'd spent four years designing against and constantly lecturing users on the evil of?\n</p>\n<p>\nI already built an X-Wing; could I build a better Tie Fighter?\n</p>\n<p>\n<img alt=\"Tie-fighter\" border=\"0\" src=\"http://www.codinghorror.com/.a/6a0120a85dcdae970b017ee83490ac970d-800wi\" title=\"Tie-fighter\" />\n</p>\n<p>\nIf you're wondering what all those sly references to Tie Fighters were about in my previous blog posts and <a href=\"https://twitter.com/codinghorror\">tweets</a>, now you know. All hail the Emperor, and by the way, what's your favorite programming food?\n</p>\n<p>\nToday we announce the launch of <a href=\"http://www.discourse.org\">Discourse</a>, a next-generation, 100% open source discussion platform built for the next decade of the Internet.\n</p>\n<p>\n<a href=\"http://www.discourse.org\"><img alt=\"Discourse-logo-big\" src=\"http://www.codinghorror.com/.a/6a0120a85dcdae970b017ee8349f31970d-800wi\" title=\"Discourse-logo-big\" /></a>\n</p>\n<p>\nThe goal of the company we formed, <b>Civilized Discourse Construction Kit, Inc.</b>, is exactly that &ndash; to raise the standard of civilized discourse on the Internet through seeding it with better discussion software:\n</p>\n<ul>\n<li>100% open source and free to the world, now and forever.\n<li>Feels <i>great</i> to use. It's fun.\n<li>Designed for hi-resolution tablets and advanced web browsers.\n<li>Built in moderation and governance systems that let discussion communities protect themselves from trolls, spammers, and bad actors &ndash; even without official moderators.\n</ul>\n</p>\n<p>\nOur <a href=\"http://blog.discourse.org/2013/02/the-discourse-team/\">amazingly talented team</a> has been working on Discourse for almost a year now, and although like any open source software it's never entirely <i>done</i>, we believe it is already a generation ahead of any other forum software we've used.\n</p>\n<p>\nI greatly admire what WordPress did for the web; to say that we want to be the WordPress of forums is not a stretch at all. We're also serious about this eventually being a viable open-source <i>business</i>, <a href=\"http://mashable.com/2011/06/01/wordpress-business-models/\">in the mold of WordPress</a>. And we're not the only people who believe in the mission: I'm proud to announce that we have initial venture capital funding from <a href=\"http://www.firstround.com/\">First Round</a>, <a href=\"http://www.greylock.com/\">Greylock</a>, and <a href=\"http://svangel.com/\">SV Angel</a>. We're embarking on a five year mission to improve the fabric of the Internet, and we're just getting started. <b>Let a million discussions bloom!</b>\n</p>\n<p>\nSo now, when someone says to me &hellip;\n</p>\n<blockquote>\n<p><i>You're so right! We need a place for community around our thing. What software should we use?</i></p>\n</blockquote>\n<p>\nI can reply without hesitation.\n</p>\n<p>\nAnd hopefully, so can you.\n</p>\n<table> \n<tr><td class=\"welovecodinghorror\"> \n[advertisement] Hiring developers? Post your open positions with <a href=\"http://careers.stackoverflow.com\" rel=\"nofollow\">Stack Overflow Careers</a> and reach over 20MM awesome devs already on Stack Overflow. Create <a href=\"http://careers.stackoverflow.com/jobs/post\" rel=\"nofollow\"> your satisfaction-guaranteed job listing</a> today! \n</td></tr> \n</table>",
            "commented_by_friends": []
        },
        {
            "story_authors": "",
            "intelligence": {
                "feed": 1,
                "tags": 0,
                "author": 0,
                "title": 0
            },
            "shared_by_friends": [],
            "story_permalink": "http://www.codinghorror.com/blog/2013/01/the-end-of-ragequitting.html",
            "reply_count": 0,
            "comment_user_ids": [
                35501,
                24291,
                24182,
                22768
            ],
            "id": "http://www.codinghorror.com/blog/2013/01/the-end-of-ragequitting.html",
            "share_user_ids": [
                35501,
                20033,
                2579,
                26928,
                24291,
                32048,
                24182,
                22768,
                42372,
                42615
            ],
            "comment_count_friends": 0,
            "story_hash": "2:48ac84",
            "comment_count": 4,
            "story_tags": [],
            "share_count": 10,
            "friend_comments": [],
            "story_date": "2013-01-21 21:10:12",
            "share_count_public": 10,
            "friend_user_ids": [],
            "public_user_ids": [
                20033,
                24291,
                42372,
                26928,
                35501,
                32048,
                22768,
                2579,
                24182,
                42615
            ],
            "short_parsed_date": "21 Jan 2013, 4:10pm",
            "guid_hash": "48ac84",
            "share_count_friends": 0,
            "story_feed_id": 2,
            "long_parsed_date": "Monday, January 21st, 2013 4:10pm",
            "public_comments": [
                {
                    "liking_users": [],
                    "source_user_id": null,
                    "user_id": 22768,
                    "shared_date": "103 days",
                    "comments": "//",
                    "replies": [],
                    "date": "2013-01-24 12:51:18.759000",
                    "id": "51012e46f01b3071d1d9e43a"
                },
                {
                    "liking_users": [
                        13
                    ],
                    "source_user_id": 32048,
                    "user_id": 24182,
                    "shared_date": "104 days",
                    "comments": "Completely agreed. This puts a finger on the concerns I've had about the coverage of Swartz.",
                    "replies": [],
                    "date": "2013-01-23 21:10:18.249000",
                    "id": "510051baf01b303971174a6d"
                },
                {
                    "liking_users": [
                        13
                    ],
                    "source_user_id": null,
                    "user_id": 24291,
                    "shared_date": "104 days",
                    "comments": "Share his frustrations - especially the point on martyrdom. If the scientists now putting their head out had done it months ago, it would have made sense. Now...",
                    "replies": [],
                    "date": "2013-01-23 10:41:20.410000",
                    "id": "50ffbe50f01b305fda6dd033"
                },
                {
                    "liking_users": [],
                    "source_user_id": null,
                    "user_id": 35501,
                    "shared_date": "106 days",
                    "comments": "Wow. ",
                    "replies": [],
                    "date": "2013-01-22 03:01:34.147000",
                    "id": "50fe010ef01b30151f301157"
                }
            ],
            "read_status": 1,
            "shared_by_public": [
                20033,
                42372,
                32048,
                26928,
                2579,
                42615
            ],
            "commented_by_public": [
                22768,
                24182,
                24291,
                35501
            ],
            "has_modifications": true,
            "comment_count_public": 4,
            "story_title": "The End of Ragequitting",
            "story_content": "<p>When Joel Spolsky, my business partner on Stack Overflow and Stack Exchange, asked me what I wanted to do after <a href=\"http://www.codinghorror.com/blog/2012/02/farewell-stack-exchange.html\">I left Stack Exchange</a>, I distinctly remember mentioning <a href=\"http://en.wikipedia.org/wiki/Aaron_Swartz\">Aaron Swartz</a>. That's what Aaron was to us hackers: <b>an exemplar of the noble, selfless behavior and positive action that all hackers <i>aspire</i> to</b> – but very few actually achieve. </p> <p>And now, tragically, Aaron is gone at the tender age of 26. He won't be achieving anything any more. </p> <p>I never knew Aaron, but I <i>knew</i> Aaron. </p> <p><a href=\"http://stackoverflow.com/users/4300/aaronsw\"><img alt=\"Aaron-swartz-stack-overflow\" border=\"0\" src=\"http://www.codinghorror.com/.a/6a0120a85dcdae970b017d404980a4970c-800wi\" title=\"Aaron-swartz-stack-overflow\"></a> </p> <p>Most of all, I am disappointed. </p> <p>I'm deeply disappointed in <b>myself</b>, for not understanding just how bitterly unfair the government charges were against Aaron. Perhaps the full, grotesque details couldn't be revealed for <ins>a pending legal case.</ins> <del>pending legislation.</del> But we should have been outraged. I am gutted that I did not contribute to his defense in any way, either financially or by writing about it here. I blindly assumed he would prevail, as powerful activists on the side of fairness, openness, and freedom are fortunate enough to <ins>often</ins> do in our country. I was wrong. </p> <p>I'm disappointed in our <b>government</b>, for going to such lengths to make an example of someone who was so obviously a positive force. Someone who actively worked to change the world for the better in everything he did, starting from the age of 12. There was no evil in this man. And yet the absurd government case against him was cited by his family as <a href=\"http://www.latimes.com/news/obituaries/la-me-0113-aaron-swartz-20130113,0,5232490.story\">directly contributing to his death</a>. </p> <p>I'm frustrated by the idea that <b>martyrdom</b> works. The death of Aaron Swartz is now turning into <a href=\"http://www.theatlantic.com/technology/archive/2013/01/aarons-law-violating-a-sites-terms-of-service-should-not-land-you-in-jail/267247/\">an effective tool for change</a>, a rallying cry, proving the perverse lesson that nobody takes an issue seriously until a great person dies for the cause. The idea that Aaron killing himself <i>was a viable strategy</i>, more than going on to prevail in this matter and so many more in his lifetime, makes me incredibly angry. </p> <p>But also, I must admit that I am a little disappointed in <b>Aaron</b>. I understand that depression is a serious disease that can fell any person, however strong. But he chose the path of the activist long ago. And the path of the activist is to <i>fight</i>, for as long and as hard as it takes, to effect change. Aaron had powerful friends, a powerful support network, and a keen sense of moral cause that put him in the right. That's how he got that support network of powerful friends and fellow activists in the first place. </p> <p>It is appropriate to write about Aaron on Martin Luther King day, because he too was <a href=\"http://www.africa.upenn.edu/Articles_Gen/Letter_Birmingham.html\">a tireless activist for moral causes</a>. </p> <blockquote>I hope you are able to see the distinction I am trying to point out. In no sense do I advocate evading or defying the law, as would the rabid segregationist. That would lead to anarchy. <b>One who breaks an unjust law must do so openly, lovingly, and with a willingness to accept the penalty.</b> I submit that an individual who breaks a law that conscience tells him is unjust, and who willingly accepts the penalty of imprisonment in order to arouse the conscience of the community over its injustice, is in reality expressing the highest respect for law. </blockquote> <p>Let's be clear that the penalty in Aaron's case was <i>grossly</i> unfair, <a href=\"http://harpers.org/blog/2013/01/carmen-ortiz-strikes-out/\">bordering on corrupt</a>. I've been a part of <a href=\"http://www.codinghorror.com/blog/2012/09/somebody-is-to-blame-for-this.html\">exactly one trial</a>, but I can't even imagine having the full resources of the US Government brought to bear against me, with extreme prejudice, for a year or more. His defense was estimated to cost millions. The idea that such an engaged citizen would be forever branded a felon – serving at least some jail time and stripped of the most fundamental citizenship right, the ability to vote – must have weighed heavily on Aaron. And Aaron was no stranger to depresson, having written about it on his blog many times, even penning a public will of sorts on his blog all the way back in 2002. </p> <p>I think about <a href=\"http://knowyourmeme.com/memes/rage-quit\">ragequitting</a> a lot. </p> <blockquote>Rage Quit, also seen as RageQuit in one word, is Internet slang commonly used to describe the act of suddenly quitting a game or chatroom after either an argument, extreme frustration, or loss of the game. </blockquote> <p>At least one user ragequits Stack Exchange every six months, because our rules are strict. Some people don't like rules, and can respond poorly when confronted by the rules of the game they choose to play. It came up often enough that we had to create even more rules to deal with it. I was forced to think about ragequitting. </p><p></p> I was very angry with <a href=\"http://en.wikipedia.org/wiki/Mark_Pilgrim_(software_developer)#.22Disappearance.22_from_the_Internet\">Mark Pilgrim</a> and <a href=\"http://en.wikipedia.org/wiki/Why_the_lucky_stiff\">_why</a> for ragequitting the Internet, because they also took all their content <ins>offline</ins> <del>with them</del> – they got so frustrated that they took their ball and went home, so nobody else could play. How incredibly rude. Ragequitting is childish, a sign of immaturity. But it is another thing entirely to play the final move and <ins>take</ins> <del>end</del> your own life. To declare the end of <ins>this game and all future</ins> <del>all</del> games, <b>the end of ragequitting itself</b>. <p>I say this not as a person who wishes to judge Aaron Swartz. I say it as a fellow gamer who has also considered playing the same move quite recently. To the point that I – like Aaron himself, I am sure – was actively researching it. But the more I researched, the more I thought about it, the more it <a href=\"http://www.cracked.com/article_15658_the-ten-minute-suicide-guide.html\">felt like what it really was</a>: <i>giving up</i>. And the toll on friends and family would be unimaginably, unbearably heavy. </p> <p>What happened to Aaron was not fair. Not even a little. But <i>this is the path of the activist</i>. The greater the injustice, the greater wrong undone when you ultimately prevail. And I am convinced, absolutely and utterly convinced, that Aaron <i>would</i> have prevailed. He would have gone on to do so many other great things. It is our great failing that we did not provide Aaron the support network he needed to see this. All we can do now is <a href=\"http://www.plainsite.org/asymptote/index.html\">continue the mission he started</a> and lobby for change to our <a href=\"http://www.forbes.com/sites/timothylee/2013/01/17/aaron-swartz-and-the-corrupt-practice-of-plea-bargaining/\">corrupt government practices of forcing plea bargains</a>. </p> <p>It gets dark sometimes. I know it does. I'm right there with you. <b>But do not, under any circumstances, give anyone the satisfaction of seeing you ragequit.</b> They don't deserve it. Play other, better moves – and consider your long game. </p> <table><tr><td class=\"welovecodinghorror\">[advertisement] <a href=\"http://careers.stackoverflow.com/\" rel=\"nofollow\">Stack Overflow Careers</a> matches the best developers (you!) with the best employers. You can search our <a href=\"http://careers.stackoverflow.com/jobs\" rel=\"nofollow\">job listings</a> or <a href=\"http://careers.stackoverflow.com/cv\" rel=\"nofollow\">create a profile</a> and even let employers find you. </td></tr></table>",
            "commented_by_friends": []
        },
        {
            "story_authors": "",
            "intelligence": {
                "feed": 1,
                "tags": 0,
                "author": 0,
                "title": 0
            },
            "shared_by_friends": [],
            "story_permalink": "http://www.codinghorror.com/blog/2012/12/web-discussions-flat-by-design.html",
            "reply_count": 0,
            "comment_user_ids": [],
            "id": "http://www.codinghorror.com/blog/2012/12/web-discussions-flat-by-design.html",
            "share_user_ids": [
                40237
            ],
            "story_hash": "2:4f1912",
            "comment_count": 0,
            "story_tags": [],
            "share_count": 1,
            "friend_comments": [],
            "story_date": "2012-12-14 01:24:02",
            "share_count_public": 1,
            "friend_user_ids": [],
            "public_user_ids": [
                40237
            ],
            "short_parsed_date": "13 Dec 2012, 8:24pm",
            "guid_hash": "4f1912",
            "share_count_friends": 0,
            "story_feed_id": 2,
            "long_parsed_date": "Thursday, December 13th, 2012 8:24pm",
            "public_comments": [],
            "read_status": 1,
            "shared_by_public": [
                40237
            ],
            "commented_by_public": [],
            "has_modifications": true,
            "story_title": "Web Discussions: Flat by Design",
            "story_content": "<p>It's been six years since I wrote <a href=\"http://www.codinghorror.com/blog/2006/11/discussions-flat-or-threaded.html\">Discussions: Flat or Threaded?</a> and, despite a bunch of evolution on the web since then, my opinion on this has not fundamentally changed. </p> <p>If anything, my opinion has strengthened based on the observed data: <i>precious few threaded discussion models survive on the web</i>. Putting aside Usenet as a relic and artifact of the past, it is rare to find threaded discussions of any kind on the web today; for web discussion communities that are more than ten years old, the vast majority are flat as a pancake. </p> <p>I'm game for trying anything new, I mean, I even tried <i>Google Wave</i>. But the more I've used threaded discussions of any variety, the less I like them. I find precious few redeeming qualities, while threading tends to break crucial parts of discussion like reading and replying in deep, fundamental, unfixable ways. I have yet to <ins>discover</ins> <del>find</del> a threaded discussion design that doesn't eventually make me hate it, and myself. </p> <p>A part of me says this is software Darwinism in action: <b>threaded discussion is ultimately too complex to survive on the public Internet</b>. </p> <p><a href=\"http://news.ycombinator.com/item?id=4887447\"><img alt=\"Hacker-news-threading\" height=\"837\" src=\"http://www.codinghorror.com/.a/6a0120a85dcdae970b017d3ec46626970c-800wi\" title=\"Hacker-news-threading\" width=\"720\"></a><br></p> <p>Before threaded discussion fans bring out their pitchforks and torches, I fully acknowledge that <i>aspects</i> of threading can be useful in certain specific situations. I will get to that. I know I'm probably wasting my time even attempting to say this, but please: keep reading before commenting. Ideally, read the <i>whole article</i> before commenting. <ins>Like</ins> <del>I know, what are the odds of that happening, but like</del> Parappa, <a href=\"http://en.wikipedia.org/wiki/PaRappa_the_Rapper\">I gotta believe!</a> </p> <p>Before I defend threaded discussion, let's enumerate the many problems it brings to the table: </p> <ol><li><b>It's a tree</b>. <br><p>Poems about trees are indeed lovely, as Joyce Kilmer promised us, but <a href=\"http://www.codinghorror.com/blog/2005/03/trees-treeviews-and-ui.html\">data of any kind represented as a tree … isn't</a>. Rigid hierarchy is generally not how the human mind works, and the strict parent-child relationship it enforces is particularly terrible for fluid human group discussion. Browsing a tree is complicated, because you have to constantly think about what level you're at, what's expanded, what's collapsed … there's always this looming existential crisis of <i>where the heck am I?</i> Discussion trees force me to spend too much time mentally managing that two-dimensional tree more than the underlying discussion. </p> </li><li><b>Where did that reply go?</b><br><p>In a threaded discussion, replies can <ins>arrive</ins> <del>come at</del> any place in the tree at any time. How do you know if there are new replies? Where do you find them? Only if you happen to be browsing the tree at the right place at the right time. It's annoying to follow discussions over time when new posts keep popping up anywhere in the middle of the big reply tree. And God help you if you accidentally reply at the wrong level of the tree; then you're suddenly talking to the wrong person, or maybe nobody at all. For that matter, it absolutely <i>kills</i> me that there might be amazing, insightful responses buried somewhere in the middle of a reply chain that I will never be able to find. <del>It makes me crazy.</del> Most of all, it just makes me want to leave and never come back.</p> </li><li><b>It pushes discussion off your screen</b>.<br><p>So the first reply is indented under the <ins>post.</ins> <del>first one.</del> Fair enough; how else would you know that one post is a reply to another post? But this indentation game <i>doesn't ever end</i>. Reply long and hard enough and you've either made the content column impossibly narrow, or you've pushed the content to exit, stage right. That's how endless pedantic responses-to-responses ruin the discussion for <ins>everyone.</ins> <del>everyone by either destroying the content or pushing it off screen.</del> I find that in the \"indent everything to the right\" game, there are no winners, only losers. It is natural to scroll <i>down</i> on the web, but it is utterly unnatural to scroll <i>right</i>. Indentation takes the discussion in the wrong direction. </p> </li><li><b>You're talking to everyone.</b><br><p>You think because you clicked \"reply\" and your post is indented under the person you're replying to, that your post is talking only to that person? That's so romantic. Maybe the two of you should get a room. A special, private room at the far, far, far, far, <i>far</i> right of that threaded discussion. This illusion that you are talking to one other person ends up harming the discussion for everyone by polluting the tree with these massive narrow branches that are constantly in the way. </p> <p>At an absolute minimum you're addressing everyone else in that discussion, but in reality, you're talking to anyone who will listen, for all time. Composing your reply as if it is a reply to just one person is a quaint artifact of a world that doesn't exist any more. Every public post you make on the Internet, reply or not, is actually talking to <i>everyone who will ever read it</i>. It'd be helpful if the systems we used for discussion made that clear, rather than maintaining this harmful pretense of private conversations in a public space. </p> </li><li><b>I just want to scroll down.</b> <p>Reddit (and to a lesser extent, Hacker News) are probably the best known examples of threaded comments applied to a large audience. While I find Reddit so much more tolerable than the bad old days of Digg, I can still barely force myself to wade through the discussions there, because it's so much darn <i>work</i>. As a lazy reader, I feel I've already done my part by deciding to enter the thread; after that all I should need to do is scroll or swipe down.</p> <p>Take <a href=\"http://www.reddit.com/r/pics/comments/14svrt/my_little_brother_had_an_interesting_night/\">what's on the top of reddit right now</a>. It's a cool picture; who wouldn't want to meet Steve Martin and Morgan Freeman? But what's the context? Who is this kid? How did he get so lucky? To find out, I need to collapse and suppress dozens of random meaningless tangents, and the replies-to-tangents, by clicking the little minus symbol next to each one. So that's what I'm doing: reading a little, deciding that tangent is not useful or interesting, and clicking it to get rid of it. Then I arrive at the end and find out that information wasn't even in the topic, or at least I couldn't find it. I'm OK with scrolling down to find information and/or entertainment, to a point. What I object to is the menial labor of collapsing and expanding threaded portions of the topic as I read. Despite what the people posting them might think, those tangents aren't so terribly important that they're worth making me, and every other reader, act on them.</p> </li></ol><p>Full bore, no-holds-barred threading is an unmitigated usability disaster for discussion, everywhere I've encountered it. But what if we didn't commit to this idea of threaded discussion quite so wholeheartedly? </p> <p>The most important guidance for non-destructive use of threading is to <b>put a hard cap <ins>on</ins> the level of replies that you allow</b>. Although <a href=\"http://meta.stackoverflow.com/questions/92107/is-stack-overflow-a-forum\">Stack Exchange is not a discussion system</a> – it's actually the <i>opposite</i> of a discussion system, which we have to explain to people all the time – we did allow, in essence, one level of threading. There are questions and answers, yes, but underneath each of those, in smaller type, are the comments. </p> <p><a href=\"http://wordpress.stackexchange.com/questions/74519/how-to-create-editable-blocks-of-text-for-the-homepage\"><img alt=\"Stack-exchange-threading\" height=\"787\" src=\"http://www.codinghorror.com/.a/6a0120a85dcdae970b017ee63983db970d-800wi\" title=\"Stack-exchange-threading\" width=\"720\"></a> </p> <p>Now there's a bunch of hard-core discussion sociology here that I don't want to get into, like different rules for comments, special limitations for comments, only showing the top n of comments by default, and so forth. What matters is that we allow <b>one level of replies and that's it</b>. Want to reply to a comment? You can, but it'll be at the same level. You can go no deeper. This is by design, but remember: <i>Stack Exchange is not a discussion system</i>. It's a question and answer system. If you build your Q&amp;A system like a discussion system, it will devolve into Yahoo Answers, or even worse, Quora. Just kidding Quora. <a href=\"http://www.quora.com/What-did-Jesus-farts-probably-smell-like\">You're great</a>. </p> <p>Would Hacker News be a better place for discussion if they capped reply level? Would Reddit? From my perspective as a poor, harried reader and very occasional participant, absolutely. There are many chronic problems with threaded discussion, but capping reply depth is the easiest way to take a giant step in the right direction. </p> <p>Another idea is to let posts bring their context with them. This is one of the things that Twitter, the company that always does everything wrong and succeeds anyway, gets … shockingly right out of the gate. When I view <a href=\"https://twitter.com/codinghorror/status/276413253209448449\">one of my tweets</a>, it can stand alone, as it should. But it can also bring some context along with it <ins>on demand:</ins> <del>as necessary:</del> </p> <p><a href=\"https://twitter.com/codinghorror/status/276413253209448449\"><img alt=\"Twitter-threading\" class=\"asset  asset-image at-xid-6a0120a85dcdae970b017ee6399d08970d image-full\" height=\"961\" src=\"http://www.codinghorror.com/.a/6a0120a85dcdae970b017ee6399d08970d-800wi\" title=\"Twitter-threading\" width=\"600\"></a> </p> <p>Here you can see how <a href=\"https://twitter.com/codinghorror/status/276413253209448449\">my tweet</a> can be expanded with a direct link or click to show the necessary context for the conversation. But it'll only show three levels: the post, my reply to the post, and replies to my post. This idea that tweets – and thus, conversations – should be mostly standalone is not well understood, but it illustrates how Twitter got the <i>original concept</i> so fundamentally right. I guess that's why they can get away with the terrible execution. </p> <p>I believe <b>selective and judicious use of threading</b> is the only way it <i>can</i> work for discussion. <ins>You</ins> <del>In general, you</del> should be wary of threading <ins>as a general purpose solution for human discussions. Always</ins> <del>and always</del> favor simple, flat discussions <ins>instead.</ins> <del>whenever possible.</del> </p> <table><tr><td class=\"welovecodinghorror\">[advertisement] How are you showing off your awesome? Create a <a href=\"http://careers.stackoverflow.com/cv\" rel=\"nofollow\">Stack Overflow Careers profile</a> and show off all of your hard work from Stack Overflow, Github, and virtually every other coding site. Who knows, you might even get recruited for a great <a href=\"http://careers.stackoverflow.com/jobs\" rel=\"nofollow\">new position</a>! </td></tr></table>",
            "commented_by_friends": []
        },
        {
            "story_authors": "",
            "intelligence": {
                "feed": 1,
                "tags": 0,
                "author": 0,
                "title": 0
            },
            "story_permalink": "http://www.codinghorror.com/blog/2012/12/the-organism-will-do-what-it-damn-well-pleases.html",
            "reply_count": 0,
            "comment_user_ids": [],
            "id": "http://www.codinghorror.com/blog/2012/12/the-organism-will-do-what-it-damn-well-pleases.html",
            "share_user_ids": [],
            "story_hash": "2:e952df",
            "comment_count": null,
            "story_tags": [],
            "share_count": null,
            "friend_comments": [],
            "story_date": "2012-12-01 09:28:35",
            "short_parsed_date": "01 Dec 2012, 4:28am",
            "guid_hash": "e952df",
            "story_feed_id": 2,
            "long_parsed_date": "Saturday, December 1st, 2012 4:28am",
            "public_comments": [],
            "read_status": 1,
            "has_modifications": true,
            "story_title": "The Organism Will Do Whatever It Damn Well Pleases",
            "story_content": "<p>In the go-go world of software development, we're so consumed with <a href=\"http://www.codinghorror.com/blog/2007/06/learning-or-learning-how-to-learn.html\">learning new things</a>, so <a href=\"http://www.codinghorror.com/blog/2008/01/the-magpie-developer.html\"> <ins>fascinated</ins> <del>obsessed</del> with the procession of shiny new <ins>objects</ins> <del>things</del> </a> that I think we sometimes <ins>lose</ins> sight of our history. I don't mean the big era-defining successes. Everyone knows those stories. I'm talking about the things we've tried before that … didn't quite work out. The failures. The also-rans. The noble experiments. The crazy plans. </p> <p>I'm all for <a href=\"http://www.codinghorror.com/blog/2009/02/dont-reinvent-the-wheel-unless-you-plan-on-learning-more-about-wheels.html\">reinventing the wheel</a>, because it's one of the best ways to learn. But you shouldn't even <i>think</i> about reinventing a damn thing <b>until you've exhaustively researched every single last wheel, old or new, working or broken, that you can lay your hands on.</b> Do your homework. </p> <p>That's why I love unearthing stories like <a href=\"http://www.fudco.com/chip/lessons.html\">The Lessons of Lucasfilm's Habitat</a>. It's basically World of Warcraft … in 1985. </p> <p></p><blockquote><p><a href=\"http://en.wikipedia.org/wiki/Habitat_(video_game)\">Habitat</a> is \"a multi-participant online virtual environment,\" a cyberspace.</p> <p><img alt=\"Habitat\" height=\"240\" src=\"http://www.codinghorror.com/.a/6a0120a85dcdae970b017c3424c4d8970b-800wi\" title=\"Habitat\" valign=\"right\" width=\"320\"></p> <p>Each participant (\"player\") uses a home computer (Commodore 64) as an intelligent, interactive client, communicating via modem and telephone over a commercial packet-switching network to a centralized, mainframe host system. The client software provides the user interface, generating a real-time animated display of what is going on and translating input from the player into messages to the host. The host maintains the system's world model enforcing the rules and keeping each player's client informed about the constantly changing state of the universe. </p> </blockquote> <p>This was the dark ages of home computing. In 1985, that 64k of memory in a Commodore 64 was a <i>lot</i>. The entirety of Turbo Pascal 3.02 for DOS, released a year later in 1986, <a href=\"http://prog21.dadgum.com/116.html\">was barely 40k</a>. </p> The very concept of a multiplayer virtual world of any kind – something we take for granted today, since every modern website is essentially a multiplayer game now — was incredibly exotic. Look at the painstaking explanation <ins>Lucasfilm had to produce</ins> <del>they had to provide</del> to even get folks to understand what the heck Habitat was, and how it worked: <iframe height=\"360\" src=\"http://www.youtube.com/embed/VVpulhO3jyc\" width=\"480\"></iframe> <p>The technical information in <a href=\"http://www.fudco.com/chip/lessons.html\">The Lessons of Lucasfilm's Habitat</a> is incredibly dated, as you'd expect, and barely useful even as trivia. But the sociological lessons of Habitat cut to the bone. They're as fresh today as they were in 1985. Computers have radically changed in the intervening 27 years, whereas people's behavior hasn't. At all. This particular passage hit home: </p> <blockquote>Again and again we found that activities based on often unconscious assumptions about player behavior had completely unexpected outcomes (when they were not simply outright failures). It was clear that we were not in control. The more people we involved in something, the less in control we were. <b>We could influence things, we could set up interesting situations, we could provide opportunities for things to happen, but we could not predict nor dictate the outcome.</b> Social engineering is, at best, an inexact science, even in proto-cyberspaces. Or, as some wag once said, \"in the most carefully constructed experiment under the most carefully controlled conditions, the organism will do whatever it damn well pleases.\" </blockquote> <p>Even more specifically: </p> <blockquote>Propelled by these experiences, we shifted into a style of operations in which we let the players themselves drive the direction of the design. This proved far more effective. <b>Instead of trying to push the community in the direction we thought it should go, an exercise rather like herding mice, we tried to observe what people were doing and aid them in it.</b> We became facilitators as much as designers and implementors. This often meant adding new features and new regions to the system at a frantic pace, but almost all of what we added was used and appreciated, since it was well matched to people's needs and desires. As the experts on how the system worked, we could often suggest new activities for people to try or ways of doing things that people might not have thought of. In this way we were able to have considerable influence on the system's development in spite of the fact that we didn't really hold the steering wheel -- more influence, in fact, than we had had when we were operating under the delusion that we controlled everything. </blockquote> <p>That's exactly what I was trying to say in <a href=\"http://www.codinghorror.com/blog/2012/02/listen-to-your-community-but-dont-let-them-tell-you-what-to-do.html\">Listen to Your Community, But Don't Let Them Tell You What to Do</a>. Unfortunately, because I hadn't read this essay until a few months ago, I figured this important lesson out <i>25 years later</i> than Randy Farmer and Chip Morningstar. So many Stack Overflow features were the direct result of observing what the community was doing, then attempting to aid them in it: </p> <ul><li>We noticed early in the Stack Overflow beta that users desperately wanted to reply to each other, and were cluttering up the system with \"answers\" that were, well, not answers to the question. Rather than chastize them for doing it wrong – <i>stupid users!</i> – we added the commenting system to give them a method of annotating answers and questions for clarifications, updates, and improvements.<br><br></li><li>I didn't think it was necessary to have a place to discuss Stack Overflow. And I was … kind of a jerk about it. The community was on the verge of creating a phpBB forum instance to discuss Stack Overflow. Faced with a nuclear ultimatum, I relented, and you know what? <a href=\"http://www.codinghorror.com/blog/2009/07/meta-is-murder.html\">They were right</a>. And I was wrong.<br><br></li><li>The community came up with an interesting convention for <a href=\"http://blog.stackoverflow.com/2009/04/handling-duplicate-questions/\">handling duplicate questions</a>, by manually editing a blockquote into the top of the question with a link to the authoritative question that it was a duplicate of. This little user editing convention eventually became the template for the official <ins>implementation.</ins> <del>implementation of handling duplicate questions.</del> </li></ul><p>I could go on and on, but I won't bore you. I'd say for every 3 features we introduced on Stack Overflow, at least two of them came more or less directly from observing the community, then trying to run alongside them, building tools that <b>helped them do what they wanted to do with less fuss and effort</b>. That was my job for the last four years. And I loved it, until I had to <a href=\"http://www.codinghorror.com/blog/2012/02/farewell-stack-exchange.html\">stop loving it</a>. </p> <p><a href=\"http://en.wikipedia.org/wiki/Randy_Farmer\">Randy Farmer</a>, one of the primary designers of Habitat at Lucasfilm, went on to work on a bunch of things that you may recognize: with <a href=\"http://en.wikipedia.org/wiki/Douglas_Crockford#Career\">Douglas Crockford</a> on JSON, The Sims Online, Second Life, Yahoo 360°, Yahoo Answers, Answers.com, and so forth. He eventually condensed some of his experience into a book, <a href=\"http://www.amazon.com/dp/059615979X/?tag=codihorr-20\">Building Web Reputation Systems</a>, which I bought in April 2011 as a Kindle edition. I didn't know who Mr. Farmer was at this time. I just saw a new O'Reilly book on an area of interest, and I thought I'd check it out. </p> <p><a href=\"http://www.amazon.com/dp/059615979X/?tag=codihorr-20\"><img alt=\"Building-web-reputation-systems\" height=\"525\" src=\"http://www.codinghorror.com/.a/6a0120a85dcdae970b017d3e54363b970c-800wi\" title=\"Building-web-reputation-systems\" width=\"400\"></a> </p> <p>As the co-founder of Stack Overflow, I know a thing or two about web reputation systems! Out of curiosity, I looked up the author on my own <ins>site.</ins> <del>site, Stack Overflow.</del> And <a href=\"http://stackoverflow.com/users/523113/f-randall-farmer\">I found him</a>, with a <i>tiny</i> reputation. So I sent this friendly jibe on Twitter: </p> <p><a href=\"https://twitter.com/frandallfarmer/status/57612082752925696\"><img alt=\"pff, look at @frandallfarmer's tiny rep! look at it!\" height=\"335\" src=\"http://www.codinghorror.com/.a/6a0120a85dcdae970b017d3e5422dd970c-800wi\" title=\"pff, look at @frandallfarmer's tiny rep! look at it!\" width=\"643\"></a> </p> <p>But the last laugh was on Randy, as it should be, because I didn't realize he had over <a href=\"http://rpg.stackexchange.com/users/810/f-randall-farmer\">6,000 reputation</a> on <a href=\"http://rpg.stackexchange.com\">rpg.stackexchange.com</a>. Turns out, Randy Farmer was already an avid Stack Exchange user. And, as you might guess given his background, a rather <i>expert</i> Stack Exchange <ins>user at that.</ins> <del>user.</del> The Stack Exchange ruleset is complex, strict, and requires discipline to understand. Kind of like.. <ins>maybe</ins> <del>maybe,</del> a <i>certain role playing game</i>, if you will. </p> <p><a href=\"http://www.reddit.com/r/rpg/comments/xiwir/about_30_years_ago_my_dad_had_his_first_edition/\"><img alt=\"Advanced-dungeons-and-dragons\" height=\"555\" src=\"http://www.codinghorror.com/.a/6a0120a85dcdae970b017ee5cb84ec970d-800wi\" title=\"Advanced-dungeons-and-dragons\" width=\"500\"></a> </p> <p>Randy is the sort of dad who <a href=\"http://www.reddit.com/r/rpg/comments/xiwir/about_30_years_ago_my_dad_had_his_first_edition/\">had his first edition Dungeons &amp; Dragons books bound into a single leather tome and handed it down to his son as a family heirloom</a>. How awesome is that? </p> <p>If we've learned anything in the last 25 years since Habitat, it is that <b>people are the source of, and solution to, all the problems you'll run into when building social software</b>. Are you looking to (dungeon) master the art of guiding and nudging your online community through their collective adventure, without violating the continuity of your own little universe? <ins>If so, you</ins> <del>You</del> could do a whole heck of lot worse than reading <a href=\"http://www.amazon.com/dp/059615979X/?tag=codihorr-20\">Building Web Reputation Systems</a> and following <a href=\"https://twitter.com/frandallfarmer\">@FRandallFarmer</a> on Twitter. </p> <table><tr><td class=\"welovecodinghorror\">[advertisement] Hiring developers? Post your open positions with <a href=\"http://careers.stackoverflow.com\" rel=\"nofollow\">Stack Overflow Careers</a> and reach over 20MM awesome devs already on Stack Overflow. Create <a href=\"http://careers.stackoverflow.com/jobs/post\" rel=\"nofollow\">your satisfaction-guaranteed job listing</a> today! </td></tr></table>"
        }
    ],
    "result": "ok",
    "feed_authors": [
        [
            "Jeff Atwood",
            13
        ]
    ],
    "user_profiles": [
        {
            "username": "samuel",
            "feed_address": "http://www.newsblur.com/social/rss/13/samuel",
            "user_id": 13,
            "feed_link": "http://samuel.newsblur.com",
            "num_subscribers": 558,
            "feed_title": "Samuel Clay's Blurblog",
            "private": false,
            "protected": false,
            "location": "The Haight in San Francisco",
            "id": "social:13",
            "photo_url": "http://a0.twimg.com/profile_images/1382021023/Campeche_Steps_normal.jpg"
        },
        {
            "username": "lamnatos",
            "feed_address": "http://www.newsblur.com/social/rss/2579/lamnatos",
            "user_id": 2579,
            "feed_link": "http://lamnatos.newsblur.com",
            "num_subscribers": 6,
            "feed_title": "Antonis Lamnatos' Blurblog",
            "private": null,
            "protected": null,
            "location": "Athens, Greece",
            "id": "social:2579",
            "photo_url": "http://www.gravatar.com/avatar/c391d4837dc446c35efcc23406b07485"
        },
        {
            "username": "silent__thought",
            "feed_address": "http://www.newsblur.com/social/rss/3833/silent__thought",
            "user_id": 3833,
            "feed_link": "http://silent__thought.newsblur.com",
            "num_subscribers": 13,
            "feed_title": "silent__thought's blurblog",
            "private": null,
            "protected": null,
            "location": "Earth",
            "id": "social:3833",
            "photo_url": "http://www.gravatar.com/avatar/bb042c7ad014d509841ab770c2cd8c8c"
        },
        {
            "username": "rpmehta",
            "feed_address": "http://www.newsblur.com/social/rss/20033/rpmehta",
            "user_id": 20033,
            "feed_link": "http://rpmehta.newsblur.com",
            "num_subscribers": 21,
            "feed_title": "Romit's blurblog",
            "private": null,
            "protected": null,
            "location": "santa clara, CA",
            "id": "social:20033",
            "photo_url": "http://a0.twimg.com/profile_images/1851424641/Photofunia_Winter_Morning_AbQNV2v63ZYuBUi26z1ovg_o_normal.jpg"
        },
        {
            "username": "beslayed",
            "feed_address": "http://www.newsblur.com/social/rss/22768/beslayed",
            "user_id": 22768,
            "feed_link": "http://beslayed.newsblur.com",
            "num_subscribers": 8,
            "feed_title": "beslayed's blurblog",
            "private": false,
            "protected": false,
            "location": "",
            "id": "social:22768",
            "photo_url": "http://graph.facebook.com/621715044/picture"
        },
        {
            "username": "wreichard",
            "feed_address": "http://www.newsblur.com/social/rss/24182/wreichard",
            "user_id": 24182,
            "feed_link": "http://wreichard.newsblur.com",
            "num_subscribers": 21,
            "feed_title": "Gallimaufries with that?",
            "private": false,
            "protected": false,
            "location": "Earth",
            "id": "social:24182",
            "photo_url": "http://graph.facebook.com/667232813/picture"
        },
        {
            "username": "superiphi",
            "feed_address": "http://www.newsblur.com/social/rss/24291/superiphi",
            "user_id": 24291,
            "feed_link": "http://superiphi.newsblur.com",
            "num_subscribers": 15,
            "feed_title": "superiphi's blurblog",
            "private": null,
            "protected": null,
            "location": "Idle, Bradford, United Kingdom",
            "id": "social:24291",
            "photo_url": "http://graph.facebook.com/539681208/picture"
        },
        {
            "username": "jhellman",
            "feed_address": "http://www.newsblur.com/social/rss/24548/jhellman",
            "user_id": 24548,
            "feed_link": "http://jhellman.newsblur.com",
            "num_subscribers": 6,
            "feed_title": "jhellman's blurblog",
            "private": null,
            "protected": null,
            "location": "Albuquerque, NM",
            "id": "social:24548",
            "photo_url": "http://graph.facebook.com/19101576/picture"
        },
        {
            "username": "pfctdayelise",
            "feed_address": "http://www.newsblur.com/social/rss/25431/pfctdayelise",
            "user_id": 25431,
            "feed_link": "http://pfctdayelise.newsblur.com",
            "num_subscribers": 8,
            "feed_title": "pfctdayelise's shared links",
            "private": null,
            "protected": null,
            "location": "Melbourne, Victoria, Australia",
            "id": "social:25431",
            "photo_url": "http://graph.facebook.com/701874244/picture"
        },
        {
            "username": "bsauline",
            "feed_address": "http://www.newsblur.com/social/rss/25518/bsauline",
            "user_id": 25518,
            "feed_link": "http://bsauline.newsblur.com",
            "num_subscribers": 2,
            "feed_title": "bsauline's blurblog",
            "private": null,
            "protected": null,
            "location": "San Francisco, California",
            "id": "social:25518",
            "photo_url": "http://graph.facebook.com/66202055/picture"
        },
        {
            "username": "llucax",
            "feed_address": "http://www.newsblur.com/social/rss/25694/llucax",
            "user_id": 25694,
            "feed_link": "http://llucax.newsblur.com",
            "num_subscribers": 3,
            "feed_title": "Luca's blurblog",
            "private": false,
            "protected": false,
            "location": "Berlin",
            "id": "social:25694",
            "photo_url": "https://www.gravatar.com/avatar/76b36a995d6d36b69eb2b9ad7ec6d85b"
        },
        {
            "username": "rickenharp",
            "feed_address": "http://www.newsblur.com/social/rss/25745/rickenharp",
            "user_id": 25745,
            "feed_link": "http://rickenharp.newsblur.com",
            "num_subscribers": 1,
            "feed_title": "rickenharp's blurblog",
            "private": null,
            "protected": null,
            "location": "Wuppertal, Germany",
            "id": "social:25745",
            "photo_url": "http://a0.twimg.com/profile_images/1393916053/ce2a75b3504fe3968437635f6b3c3a58_normal.jpeg"
        },
        {
            "username": "hugochisholm",
            "feed_address": "http://www.newsblur.com/social/rss/26928/hugochisholm",
            "user_id": 26928,
            "feed_link": "http://hugochisholm.newsblur.com",
            "num_subscribers": 3,
            "feed_title": "hugochisholm's blurblog",
            "private": null,
            "protected": null,
            "location": "Vancouver, BC",
            "id": "social:26928",
            "photo_url": "http://a0.twimg.com/profile_images/1814051723/eightbit-682d5b1a-261e-4d3f-80f0-ace16adf5e1d_normal.png"
        },
        {
            "username": "brico",
            "feed_address": "http://www.newsblur.com/social/rss/27384/brico",
            "user_id": 27384,
            "feed_link": "http://brico.newsblur.com",
            "num_subscribers": 10,
            "feed_title": "machines language",
            "private": null,
            "protected": null,
            "location": "Washington, DC",
            "id": "social:27384",
            "photo_url": "http://a0.twimg.com/profile_images/1184802534/red-b-trans_normal.png"
        },
        {
            "username": "popular",
            "feed_address": "http://www.newsblur.com/social/rss/32048/popular",
            "user_id": 32048,
            "feed_link": "http://popular.newsblur.com",
            "num_subscribers": 7724,
            "feed_title": "The People Have Spoken",
            "private": false,
            "protected": false,
            "location": "",
            "id": "social:32048",
            "photo_url": "https://s3.amazonaws.com/avatars.newsblur.com/avatars/32048/thumbnail_profile_1358188630.jpg"
        },
        {
            "username": "glenn",
            "feed_address": "http://www.newsblur.com/social/rss/33448/glenn",
            "user_id": 33448,
            "feed_link": "http://glenn.newsblur.com",
            "num_subscribers": 7,
            "feed_title": "Glenn's blurblog",
            "private": null,
            "protected": null,
            "location": "Waterloo, Canada",
            "id": "social:33448",
            "photo_url": "http://www.gravatar.com/avatar/576ef3765840c8717ff6bf5c79de41e8"
        },
        {
            "username": "chrisamico",
            "feed_address": "http://www.newsblur.com/social/rss/35501/chrisamico",
            "user_id": 35501,
            "feed_link": "http://chrisamico.newsblur.com",
            "num_subscribers": 34,
            "feed_title": "chrisamico's blurblog",
            "private": null,
            "protected": null,
            "location": "Cambridge, MA",
            "id": "social:35501",
            "photo_url": "http://a0.twimg.com/profile_images/61022648/Photo_18_normal.jpg"
        },
        {
            "username": "skrivsm",
            "feed_address": "http://www.newsblur.com/social/rss/40237/skrivsm",
            "user_id": 40237,
            "feed_link": "http://skrivsm.newsblur.com",
            "num_subscribers": 0,
            "feed_title": "skrivsm's blurblog",
            "private": null,
            "protected": null,
            "location": "Peoria, IL",
            "id": "social:40237",
            "photo_url": "http://a0.twimg.com/profile_images/41220752/Shawn_2x2in_normal.jpg"
        },
        {
            "username": "himabinduchitta",
            "feed_address": "http://www.newsblur.com/social/rss/42372/himabinduchitta",
            "user_id": 42372,
            "feed_link": "http://himabinduchitta.newsblur.com",
            "num_subscribers": 0,
            "feed_title": "himabinduchitta's blurblog",
            "private": null,
            "protected": null,
            "location": null,
            "id": "social:42372",
            "photo_url": "http://www.newsblur.com/media/img/reader/default_profile_photo.png"
        },
        {
            "username": "herrmann",
            "feed_address": "http://www.newsblur.com/social/rss/42615/herrmann",
            "user_id": 42615,
            "feed_link": "http://herrmann.newsblur.com",
            "num_subscribers": 3,
            "feed_title": "herrmann's blurblog",
            "private": false,
            "protected": false,
            "location": "Brazil",
            "id": "social:42615",
            "photo_url": "http://www.newsblur.com/media/img/reader/default_profile_photo.png"
        },
        {
            "username": "xiaonanji",
            "feed_address": "http://www.newsblur.com/social/rss/43759/xiaonanji",
            "user_id": 43759,
            "feed_link": "http://xiaonanji.newsblur.com",
            "num_subscribers": 1,
            "feed_title": "xiaonanji's blurblog",
            "private": null,
            "protected": null,
            "location": null,
            "id": "social:43759",
            "photo_url": "http://www.newsblur.com/media/img/reader/default_profile_photo.png"
        },
        {
            "username": "DerCed",
            "feed_address": "http://www.newsblur.com/social/rss/81613/derced",
            "user_id": 81613,
            "feed_link": "http://derced.newsblur.com",
            "num_subscribers": 0,
            "feed_title": "DerCed's blurblog",
            "private": null,
            "protected": null,
            "location": "Basel, Switzerland",
            "id": "social:81613",
            "photo_url": "http://a0.twimg.com/profile_images/2652183404/11e214a838a809eed97a63b776260e9d_normal.jpeg"
        },
        {
            "username": "kalle",
            "feed_address": "http://www.newsblur.com/social/rss/82036/kalle",
            "user_id": 82036,
            "feed_link": "http://kalle.newsblur.com",
            "num_subscribers": 0,
            "feed_title": "kalle's blurblog",
            "private": null,
            "protected": null,
            "location": null,
            "id": "social:82036",
            "photo_url": "http://www.newsblur.com/media/img/reader/default_profile_photo.png"
        },
        {
            "username": "Chico75",
            "feed_address": "http://www.newsblur.com/social/rss/91680/chico75",
            "user_id": 91680,
            "feed_link": "http://chico75.newsblur.com",
            "num_subscribers": 0,
            "feed_title": "Chico75's blurblog",
            "private": null,
            "protected": null,
            "location": "Hoboken, New Jersey",
            "id": "social:91680",
            "photo_url": "http://graph.facebook.com/759034827/picture"
        },
        {
            "username": "reconbot",
            "feed_address": "http://www.newsblur.com/social/rss/106973/reconbot",
            "user_id": 106973,
            "feed_link": "http://reconbot.newsblur.com",
            "num_subscribers": 5,
            "feed_title": "reconbot's blurblog",
            "private": false,
            "protected": false,
            "location": "New York City",
            "id": "social:106973",
            "photo_url": "http://a0.twimg.com/profile_images/2755247314/7d328b3045eb259251c28d7ce365d399_normal.png"
        },
        {
            "username": "donw",
            "feed_address": "http://www.newsblur.com/social/rss/115931/donw",
            "user_id": 115931,
            "feed_link": "http://donw.newsblur.com",
            "num_subscribers": 3,
            "feed_title": "donw's blurblog",
            "private": null,
            "protected": null,
            "location": "iPhone: 38.890922,-77.086446",
            "id": "social:115931",
            "photo_url": "http://a0.twimg.com/profile_images/1208720471/4927440117_cbb46cb2e3_b_normal.jpg"
        },
        {
            "username": "marvingreenberg",
            "feed_address": "http://www.newsblur.com/social/rss/116690/marvingreenberg",
            "user_id": 116690,
            "feed_link": "http://marvingreenberg.newsblur.com",
            "num_subscribers": 0,
            "feed_title": "marvingreenberg's blurblog",
            "private": null,
            "protected": null,
            "location": null,
            "id": "social:116690",
            "photo_url": "http://www.newsblur.com/media/img/reader/default_profile_photo.png"
        },
        {
            "username": "apadilla",
            "feed_address": "http://www.newsblur.com/social/rss/120868/apadilla",
            "user_id": 120868,
            "feed_link": "http://apadilla.newsblur.com",
            "num_subscribers": 2,
            "feed_title": "apadilla's blurblog",
            "private": false,
            "protected": false,
            "location": "San Diego",
            "id": "social:120868",
            "photo_url": "http://www.newsblur.com/media/img/reader/default_profile_photo.png"
        }
    ]
}
